VitrinaSibianaRO/ProiectVentilatie/ESP32/ProiectVentilatie.ino
// ============================================================
//  ProiectVentilatie.ino
//
//  Arhitectură production-grade pentru automatizare ventilaţie:
//  - Logica releelor este 100% locală şi autonomă.
//  - Blynk + HiveMQ MQTT în paralel (Faza 2: comenzi + lock).
//  - Parametrii sunt persistaţi în NVS (supravieţuiesc reboot).
//  - Sistemul funcţionează complet offline dacă Blynk/MQTT pică.
//  - Override manual cu timeout automat (nu rămâne blocat).
//  - Watchdog hardware 60s împotriva oricărui blocaj.
//  - Lock bidirecţional Blynk ↔ MAUI previne conflicte.
// ============================================================

#include "Config.h"
#include "AppPreferences.h"
#include "SystemLED.h"
#include "VentilationZone.h"
#include "MqttBridge.h"
#include "TimeSync.h"
#include "EventLog.h"
#include "OtaUpdater.h"

#include <WiFi.h>
#include <WiFiManager.h>
#include <BlynkSimpleEsp32.h>
#include <esp_task_wdt.h>

// ============================================================
//  OBIECTE GLOBALE
// ============================================================
AppPreferences  prefs;
SystemLED       statusLed(LED_COUNT, LED_PIN, LED_ENABLE_PIN);
VentilationZone leftZone (DHT_LEFT_PIN,  RELAY_LEFT_PIN,  "STANGA");
VentilationZone rightZone(DHT_RIGHT_PIN, RELAY_RIGHT_PIN, "DREAPTA");
BlynkTimer      timer;
MqttBridge      mqtt;
EventLog        eventLog;

// ============================================================
//  FORWARD DECLARATIONS
// ============================================================
void processZones();
void pushRelayState();
void rebuildMainTimer();
void safeStopRelays();
void checkMemory();

// ============================================================
//  STARE INTERNĂ
// ============================================================

// ID-ul timerului principal — reținut pentru a-l putea reface
// când se schimbă intervalul fără race condition.
int  mainTimerID        = -1;
bool timerRebuildNeeded = false;

// Pending flags pentru comenzile venite din Blynk.
// Handler-ii BLYNK_WRITE scriu aici; logica se aplică în processZones().
struct PendingCmd {
    bool    overrideLeftSet   = false;
    bool    overrideLeftVal   = false;
    bool    overrideLeftClear = false;

    bool    overrideRightSet   = false;
    bool    overrideRightVal   = false;
    bool    overrideRightClear = false;

    bool    resetDefaults = false;
    bool    restartDevice = false;
} pending;

// Valori trimise anterior către Blynk — pentru trimitere condiţionată.
float lastSentTempL = -999.f, lastSentHumL = -999.f;
float lastSentTempR = -999.f, lastSentHumR = -999.f;
int   cycleCount    = 0;

// WiFi reconnect throttle
unsigned long lastWiFiCheckMs = 0;

// WiFi down — restart preventiv după 10 min (Faza 3)
unsigned long wifiDownSinceMs = 0;
bool          wifiWasDown     = false;

// Stare anterioară releu — pentru detecție tranziție (event log)
bool prevRelayLeft  = false;
bool prevRelayRight = false;

// Buton fizic reset
unsigned long buttonPressMs  = 0;
bool          buttonHeld     = false;

// ============================================================
//  FUNCŢII HELPER
// ============================================================

void safeStopRelays() {
    leftZone.emergencyOff();
    rightZone.emergencyOff();
}

void rebuildMainTimer() {
    if (mainTimerID >= 0) timer.deleteTimer(mainTimerID);
    mainTimerID = timer.setInterval((long)prefs.intervalSec * 1000L, processZones);
    Serial.printf("[Timer] Interval setat la %d secunde.\n", prefs.intervalSec);
}

// Sincronizează starea curentă a releelor, overrides şi lock spre Blynk.
// Apelată după orice schimbare locală, nu la comandă din cloud.
void pushRelayState() {
    if (!Blynk.connected()) return;
    Blynk.virtualWrite(VP_RELAY_LEFT,    leftZone.getRelayState()  ? 1 : 0);
    Blynk.virtualWrite(VP_RELAY_RIGHT,   rightZone.getRelayState() ? 1 : 0);
    Blynk.virtualWrite(VP_OVERRIDE_LEFT,  leftZone.getManualOverride()  ? 1 : 0);
    Blynk.virtualWrite(VP_OVERRIDE_RIGHT, rightZone.getManualOverride() ? 1 : 0);
    Blynk.virtualWrite(VP_LOCK_OWNER,    (int)mqtt.getLockOwner());
}

// ============================================================
//  CICLU PRINCIPAL DE CITIRE + DECIZIE
//  Apelat periodic de BlynkTimer. Tot ce ţine de logica
//  releelor se întâmplă EXCLUSIV aici.
// ============================================================
void processZones() {
    Serial.println("\n--- Ciclu senzori ---");

    // 0. Procesare pending MQTT commands (Faza 2).
    //    Callback-ul MQTT setează doar flags; aici le aplicăm.
    if (mqtt.hasPendingCommands()) {
        MqttPending& mp = mqtt.getPending();

        if (mp.refresh) {
            mp.refresh = false;
            mqtt.requestPublishNow();
            Serial.println("[MQTT] cmd:refresh → push state.");
        }

        if (mp.setOverrideL) {
            mp.setOverrideL = false;
            if (mp.overrideLVal == 2) {
                prefs.saveOverrideLeft(false);
                leftZone.setManualOverride(false);
                Serial.println("[MQTT] Override stânga: cleared.");
            } else {
                bool val = (mp.overrideLVal == 1);
                prefs.saveOverrideLeft(val);
                leftZone.setManualOverride(val);
                Serial.printf("[MQTT] Override stânga: %s\n", val ? "ON" : "OFF");
            }
        }

        if (mp.setOverrideR) {
            mp.setOverrideR = false;
            if (mp.overrideRVal == 2) {
                prefs.saveOverrideRight(false);
                rightZone.setManualOverride(false);
                Serial.println("[MQTT] Override dreapta: cleared.");
            } else {
                bool val = (mp.overrideRVal == 1);
                prefs.saveOverrideRight(val);
                rightZone.setManualOverride(val);
                Serial.printf("[MQTT] Override dreapta: %s\n", val ? "ON" : "OFF");
            }
        }

        if (mp.setConfig) {
            mp.setConfig = false;
            if (mp.threshT > 0 && mp.threshT < 80.0f)
                prefs.saveTempThresh(mp.threshT);
            if (mp.threshH >= 0 && mp.threshH <= 100.0f)
                prefs.saveHumThresh(mp.threshH);
            if (mp.interval >= MIN_INTERVAL_SEC && mp.interval <= MAX_INTERVAL_SEC) {
                prefs.saveIntervalSec(mp.interval);
                timerRebuildNeeded = true;
            }
            if (mp.hystT >= 0.0f) prefs.saveTempHyst(mp.hystT);
            if (mp.hystH >= 0.0f) prefs.saveHumHyst(mp.hystH);
            // Sync Blynk UI cu valorile noi
            if (Blynk.connected()) {
                Blynk.virtualWrite(VP_THRESH_TEMP, prefs.tempThresh);
                Blynk.virtualWrite(VP_THRESH_HUM,  prefs.humThresh);
                Blynk.virtualWrite(VP_INTERVAL,    prefs.intervalSec);
            }
            Serial.printf("[MQTT] Config: T≥%.1f (hyst %.1f) H≥%.1f (hyst %.1f) Int:%d\n",
                prefs.tempThresh, prefs.tempHyst, prefs.humThresh, prefs.humHyst, prefs.intervalSec);
        }

        if (mp.resetDefaults) {
            mp.resetDefaults = false;
            prefs.resetToDefaults();
            leftZone.setManualOverride(false);
            rightZone.setManualOverride(false);
            timerRebuildNeeded = true;
            if (Blynk.connected()) {
                Blynk.virtualWrite(VP_THRESH_TEMP,     prefs.tempThresh);
                Blynk.virtualWrite(VP_THRESH_HUM,      prefs.humThresh);
                Blynk.virtualWrite(VP_INTERVAL,        prefs.intervalSec);
                Blynk.virtualWrite(VP_OVERRIDE_LEFT,   0);
                Blynk.virtualWrite(VP_OVERRIDE_RIGHT,  0);
                Blynk.virtualWrite(VP_RESET_DEFAULTS,  0);
            }
            Serial.println("[MQTT] cmd:reset → defaults restaurate.");
        }

        if (mp.reboot) {
            mp.reboot = false;
            Serial.println("[MQTT] cmd:reboot → restart curat.");
            if (Blynk.connected())
                Blynk.logEvent("system_restart", "Restart MQTT.");
            mqtt.publishOnline(false);
            delay(200);
            safeStopRelays();
            delay(300);
            ESP.restart();
        }

        // cmd:getLog — citește log din NVS și publică pe ventilatie/log
        if (mp.getLog) {
            mp.getLog = false;
            char logBuf[4096];
            size_t n = eventLog.dumpJson(logBuf, sizeof(logBuf));
            if (n > 0) {
                mqtt.publishLog(logBuf, n);
            } else {
                mqtt.publishLog("{\"entries\":[]}", 16);
            }
            Serial.println("[MQTT] cmd:getLog → log publicat.");
        }

