VitrinaSibianaRO/ProiectVentilatie/ESP32/ProiectVentilatie.ino
        // cmd:update — OTA via GitHub releases
        if (mp.update) {
            mp.update = false;
            Serial.println("[MQTT] cmd:update → start OTA...");

            // Callback pentru progress reporting pe MQTT
            auto otaProgress = [](int pct) {
                char evBuf[64];
                snprintf(evBuf, sizeof(evBuf),
                    "{\"event\":\"ota_progress\",\"pct\":%d}", pct);
                mqtt.publishEventJson(evBuf);
            };

            OtaResult res = OtaUpdater::start(mp.otaUrl, mp.otaSha, otaProgress);

            if (res == OTA_OK) {
                // OTA reușit — restart
                mqtt.publishEventJson("{\"event\":\"ota_done\"}");
                mqtt.publishOnline(false);
                delay(200);
                ESP.restart();
            } else {
                // OTA eșuat
                const char* reasons[] = {
                    "ok", "url_invalid", "connect", "http",
                    "begin", "write", "end", "sha_mismatch"
                };
                char evBuf[128];
                snprintf(evBuf, sizeof(evBuf),
                    "{\"event\":\"ota_failed\",\"reason\":\"%s\"}",
                    reasons[(int)res]);
                mqtt.publishEventJson(evBuf);
                Serial.printf("[OTA] Failed: %s\n", reasons[(int)res]);
            }
        }

        // Sync Blynk relay/override state
        pushRelayState();

        // Release lock + push state cu lock=null
        mqtt.setLockOwner(LOCK_NONE);
        mqtt.requestPublishNow();
    }

    // 1. Aplică comenzile pending sosite din Blynk în ciclu anterior.
    //    Facem asta la începutul ciclului, nu în handler, pentru a evita
    //    orice interacţiune între ISR-ul Blynk şi digitalWrite.
    bool blynkPendingProcessed = false;
    if (pending.resetDefaults) {
        pending.resetDefaults = false;
        blynkPendingProcessed = true;
        prefs.resetToDefaults();
        leftZone.setManualOverride(false);
        rightZone.setManualOverride(false);
        timerRebuildNeeded = true;
        // Sincronizăm UI-ul Blynk cu noile valori default
        if (Blynk.connected()) {
            Blynk.virtualWrite(VP_THRESH_TEMP,     prefs.tempThresh);
            Blynk.virtualWrite(VP_THRESH_HUM,      prefs.humThresh);
            Blynk.virtualWrite(VP_INTERVAL,        prefs.intervalSec);
            Blynk.virtualWrite(VP_OVERRIDE_LEFT,   0);
            Blynk.virtualWrite(VP_OVERRIDE_RIGHT,  0);
            Blynk.virtualWrite(VP_RESET_DEFAULTS,  0);
        }
    }

    if (pending.overrideLeftClear) {
        pending.overrideLeftClear = false;
        blynkPendingProcessed = true;
        prefs.saveOverrideLeft(false);
        leftZone.setManualOverride(false);
    } else if (pending.overrideLeftSet) {
        pending.overrideLeftSet = false;
        blynkPendingProcessed = true;
        prefs.saveOverrideLeft(pending.overrideLeftVal);
        leftZone.setManualOverride(pending.overrideLeftVal);
    }

    if (pending.overrideRightClear) {
        pending.overrideRightClear = false;
        blynkPendingProcessed = true;
        prefs.saveOverrideRight(false);
        rightZone.setManualOverride(false);
    } else if (pending.overrideRightSet) {
        pending.overrideRightSet = false;
        blynkPendingProcessed = true;
        prefs.saveOverrideRight(pending.overrideRightVal);
        rightZone.setManualOverride(pending.overrideRightVal);
    }

    // Dacă am procesat un pending Blynk, publicăm state imediat + release lock
    if (blynkPendingProcessed) {
        mqtt.setLockOwner(LOCK_NONE);
        mqtt.requestPublishNow();
    }

    // 2. Verifică timeout overrides (expiră după N ore).
    bool overrideExpired = prefs.tickOverrideExpiry();
    if (overrideExpired) {
        leftZone.setManualOverride(prefs.overrideLeft);
        rightZone.setManualOverride(prefs.overrideRight);
        if (Blynk.connected()) {
            Blynk.virtualWrite(VP_OVERRIDE_LEFT,  0);
            Blynk.virtualWrite(VP_OVERRIDE_RIGHT, 0);
            Blynk.logEvent("override_expired", "Override manual a expirat automat.");
        }
        // Event log — override expired (Faza 3)
        if (!prefs.overrideLeft)
            eventLog.append(EVT_OVERRIDE_EXPIRED, ZONE_LEFT, "Override anulat");
        if (!prefs.overrideRight)
            eventLog.append(EVT_OVERRIDE_EXPIRED, ZONE_RIGHT, "Override anulat");
        mqtt.requestPublishNow();
    }

    // 3. Citeşte senzorii (cooldown intern în VentilationZone).
    leftZone.readSensor();
    rightZone.readSensor();

    // 4. Aplică logica de decizie locală — SINGURA sursă de adevăr.
    leftZone.updateLogic (prefs.tempThresh, prefs.humThresh, prefs.tempHyst, prefs.humHyst);
    rightZone.updateLogic(prefs.tempThresh, prefs.humThresh, prefs.tempHyst, prefs.humHyst);

    Serial.printf("  [STANGA]  T:%.1f°C  H:%.1f%%  Releu:%s  Override:%s\n",
        leftZone.getTemp(), leftZone.getHum(),
        leftZone.getRelayState() ? "ON" : "OFF",
        leftZone.getManualOverride() ? "DA" : "NU");
    Serial.printf("  [DREAPTA] T:%.1f°C  H:%.1f%%  Releu:%s  Override:%s\n",
        rightZone.getTemp(), rightZone.getHum(),
        rightZone.getRelayState() ? "ON" : "OFF",
        rightZone.getManualOverride() ? "DA" : "NU");

    // 5. Raportează datele către Blynk (condiţionat — nu trimiteri inutile).
    if (Blynk.connected()) {
        cycleCount++;
        bool forceUpdate = (cycleCount >= 10);   // heartbeat la 10 cicluri
        if (forceUpdate) cycleCount = 0;

        if (leftZone.isFirstReadDone()) {
            float tL = leftZone.getTemp(), hL = leftZone.getHum();
            if (forceUpdate || fabsf(tL - lastSentTempL) >= 0.5f
                            || fabsf(hL - lastSentHumL)  >= 1.0f) {
                Blynk.virtualWrite(VP_TEMP_LEFT, tL);
                Blynk.virtualWrite(VP_HUM_LEFT,  hL);
                lastSentTempL = tL; lastSentHumL = hL;
            }
        }

        if (rightZone.isFirstReadDone()) {
            float tR = rightZone.getTemp(), hR = rightZone.getHum();
            if (forceUpdate || fabsf(tR - lastSentTempR) >= 0.5f
                            || fabsf(hR - lastSentHumR)  >= 1.0f) {
                Blynk.virtualWrite(VP_TEMP_RIGHT, tR);
                Blynk.virtualWrite(VP_HUM_RIGHT,  hR);
                lastSentTempR = tR; lastSentHumR = hR;
            }
        }

        // Starea releelor şi overrides — mereu trimise (sunt valori de stare).
        pushRelayState();

