VitrinaSibianaRO/ProiectVentilatie/ESP32/ProiectVentilatie.ino
        if (forceUpdate)
            Serial.println("  [Blynk] Heartbeat trimis.");
    }

    // Alertă erori consecutive senzor + event log (Faza 3)
    if (leftZone.getConsecErrors() >= 5) {
        if (Blynk.connected())
            Blynk.logEvent("sensor_error", "Senzor STANGA: 5+ erori consecutive!");
        // Log doar la exact 5 (nu la fiecare ciclu)
        if (leftZone.getConsecErrors() == 5)
            eventLog.append(EVT_SENSOR_ERR, ZONE_LEFT, "5 erori DHT");
    }
    if (rightZone.getConsecErrors() >= 5) {
        if (Blynk.connected())
            Blynk.logEvent("sensor_error", "Senzor DREAPTA: 5+ erori consecutive!");
        if (rightZone.getConsecErrors() == 5)
            eventLog.append(EVT_SENSOR_ERR, ZONE_RIGHT, "5 erori DHT");
    }

    // Detectare tranziție releu — event log (Faza 3)
    if (leftZone.getRelayState() != prevRelayLeft) {
        prevRelayLeft = leftZone.getRelayState();
        const char* msg = prevRelayLeft
            ? (leftZone.getManualOverride() ? "ON override" : "ON auto")
            : (leftZone.getManualOverride() ? "OFF override" : "OFF auto");
        eventLog.append(EVT_RELAY_CHANGE, ZONE_LEFT, msg);
    }
    if (rightZone.getRelayState() != prevRelayRight) {
        prevRelayRight = rightZone.getRelayState();
        const char* msg = prevRelayRight
            ? (rightZone.getManualOverride() ? "ON override" : "ON auto")
            : (rightZone.getManualOverride() ? "OFF override" : "OFF auto");
        eventLog.append(EVT_RELAY_CHANGE, ZONE_RIGHT, msg);
    }
}

void checkMemory() {
    uint32_t heap = ESP.getFreeHeap();
    Serial.printf("[Sistem] Heap liber: %u bytes\n", heap);
    if (Blynk.connected())
        Blynk.virtualWrite(VP_FREE_HEAP, heap / 1024);
    if (heap < 30000) {
        Serial.println("[CRITIC] Heap critic! Restart preventiv...");
        mqtt.publishOnline(false);
        delay(200);
        safeStopRelays();
        delay(300);
        ESP.restart();
    }
}

// ============================================================
//  BLYNK HANDLERS
//  REGULĂ: handler-ii NU scriu direct în releu şi NU apelează
//  digitalWrite. Setează doar flags/valori; processZones() decide.
// ============================================================

BLYNK_CONNECTED() {
    // Sincronizăm DOAR parametrii de configurare din cloud.
    // V5, V6 (starea releelor) NU sunt sincronizate — ESP32 le impune.
    Blynk.syncVirtual(VP_THRESH_TEMP, VP_THRESH_HUM, VP_INTERVAL, VP_RESET_DEFAULTS);
    // Trimitem imediat starea curentă a releelor spre UI
    pushRelayState();
    // Lock owner reset + firmware build number (Faza 2)
    Blynk.virtualWrite(VP_LOCK_OWNER, (int)mqtt.getLockOwner());
    Blynk.virtualWrite(VP_FW_BUILD, (int)FW_BUILD_NUMBER);
    Serial.println("[Blynk] Conectat. Parametri sincronizaţi.");
}

BLYNK_WRITE(VP_THRESH_TEMP) {
    if (mqtt.getLockOwner() == LOCK_MQTT) {
        Blynk.virtualWrite(VP_THRESH_TEMP, prefs.tempThresh);
        return;
    }
    float v = param.asFloat();
    if (v > 0 && v < 80.0f) {
        mqtt.setLockOwner(LOCK_BLYNK);
        mqtt.requestPublishNow();
        prefs.saveTempThresh(v);
        Serial.printf("[Blynk] Prag temperatură: %.1f°C\n", v);
    }
}

BLYNK_WRITE(VP_THRESH_HUM) {
    if (mqtt.getLockOwner() == LOCK_MQTT) {
        Blynk.virtualWrite(VP_THRESH_HUM, prefs.humThresh);
        return;
    }
    float v = param.asFloat();
    if (v >= 0 && v <= 100.0f) {
        mqtt.setLockOwner(LOCK_BLYNK);
        mqtt.requestPublishNow();
        prefs.saveHumThresh(v);
        Serial.printf("[Blynk] Prag umiditate: %.1f%%\n", v);
    }
}

BLYNK_WRITE(VP_INTERVAL) {
    if (mqtt.getLockOwner() == LOCK_MQTT) {
        Blynk.virtualWrite(VP_INTERVAL, prefs.intervalSec);
        return;
    }
    int v = param.asInt();
    v = constrain(v, MIN_INTERVAL_SEC, MAX_INTERVAL_SEC);
    mqtt.setLockOwner(LOCK_BLYNK);
    mqtt.requestPublishNow();
    prefs.saveIntervalSec(v);
    // Timer-ul va fi refăcut în loop() — nu din handler Blynk.
    timerRebuildNeeded = true;
    Serial.printf("[Blynk] Interval solicitat: %d sec\n", v);
}

// Override stânga: 1 = forţat ON, 0 = forţat OFF, 2 = clear (revenire la auto)
BLYNK_WRITE(VP_OVERRIDE_LEFT) {
    if (mqtt.getLockOwner() == LOCK_MQTT) {
        Blynk.virtualWrite(VP_OVERRIDE_LEFT, leftZone.getManualOverride() ? 1 : 0);
        return;
    }
    mqtt.setLockOwner(LOCK_BLYNK);
    mqtt.requestPublishNow();
    int v = param.asInt();
    if (v == 2) {
        pending.overrideLeftClear = true;
    } else {
        pending.overrideLeftSet = true;
        pending.overrideLeftVal = (v == 1);
    }
}

// Override dreapta: aceeaşi convenţie
BLYNK_WRITE(VP_OVERRIDE_RIGHT) {
    if (mqtt.getLockOwner() == LOCK_MQTT) {
        Blynk.virtualWrite(VP_OVERRIDE_RIGHT, rightZone.getManualOverride() ? 1 : 0);
        return;
    }
    mqtt.setLockOwner(LOCK_BLYNK);
    mqtt.requestPublishNow();
    int v = param.asInt();
    if (v == 2) {
        pending.overrideRightClear = true;
    } else {
        pending.overrideRightSet = true;
        pending.overrideRightVal = (v == 1);
    }
}

BLYNK_WRITE(VP_RESET_DEFAULTS) {
    if (mqtt.getLockOwner() == LOCK_MQTT) {
        Blynk.virtualWrite(VP_RESET_DEFAULTS, 0);
        return;
    }
    if (param.asInt() == 1) {
        mqtt.setLockOwner(LOCK_BLYNK);
        mqtt.requestPublishNow();
        pending.resetDefaults = true;
    }
}

BLYNK_WRITE(VP_RESTART) {
    if (param.asInt() == 1) {
        Serial.println("[Blynk] Comandă restart primită.");
        if (Blynk.connected())
            Blynk.logEvent("system_restart", "Restart la cererea utilizatorului.");
        mqtt.publishOnline(false);
        delay(200);
        statusLed.setBlue();
        safeStopRelays();
        delay(500);
        ESP.restart();
    }
}

// ============================================================
//  SETUP
// ============================================================
void setup() {
    Serial.begin(115200);
    delay(500);
    Serial.println("\n=== Pornire sistem ventilatie ===");

