VitrinaSibianaRO/ProiectVentilatie/ESP32/ProiectVentilatie.ino
    // Iniţializăm hardware-ul înainte de orice altceva.
    statusLed.begin();
    leftZone.begin();
    rightZone.begin();
    pinMode(RESET_BUTTON_PIN, INPUT_PULLUP);

    // Încărcăm parametrii din NVS — aceştia vor ghida logica de la primul ciclu.
    prefs.begin();
    Serial.printf("[Prefs] Încărcaţi: T≥%.0f°C  H≥%.0f%%  Interval:%ds\n",
        prefs.tempThresh, prefs.humThresh, prefs.intervalSec);

    // Watchdog — iniţializat DUPĂ delay-urile de boot.
    // API-ul diferă între arduino-esp32 2.x şi 3.x — detectăm la compilare.
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    esp_task_wdt_deinit();
    esp_task_wdt_config_t wdt_cfg = {
        .timeout_ms     = WDT_TIMEOUT_SEC * 1000,
        .idle_core_mask = (1 << 0),
        .trigger_panic  = true
    };
    esp_task_wdt_init(&wdt_cfg);
#else
    esp_task_wdt_init(WDT_TIMEOUT_SEC, true);
#endif
    esp_task_wdt_add(NULL);
    Serial.printf("[WDT] Watchdog iniţializat: %ds timeout.\n", WDT_TIMEOUT_SEC);

    // WiFiManager — portal captiv dacă nu există reţea salvată.
    WiFiManager wm;
    wm.setConnectTimeout(30);
    wm.setConfigPortalTimeout(180);
    if (!wm.autoConnect(WIFI_AP_NAME)) {
        Serial.println("[WiFi] Timeout portal. Restart...");
        safeStopRelays();
        delay(1000);
        ESP.restart();
    }
    Serial.printf("[WiFi] Conectat: %s  IP: %s\n",
        WiFi.SSID().c_str(), WiFi.localIP().toString().c_str());

    // NTP sync (Faza 3) — trebuie după WiFi connect
    TimeSync::begin();

    // Event log (Faza 3) — NVS namespace "log"
    eventLog.begin();

    Blynk.config(BLYNK_AUTH_TOKEN);
    // Nu blocăm în connect — sistemul porneşte şi fără Blynk.
    Blynk.connect(3000);

    // MQTT bridge — conectare non-blocking, încercări periodice în loop().
    mqtt.begin(&prefs);

    // Timer principal de citire senzori.
    mainTimerID = timer.setInterval((long)prefs.intervalSec * 1000L, processZones);
    // Verificare memorie la fiecare 10 minute.
    timer.setInterval(600000L, checkMemory);

    // Facem o primă citire imediată, fără să aşteptăm primul interval.
    processZones();

    Serial.printf("[Setup] Sistem pornit cu succes. Firmware build #%d\n",
                  (int)FW_BUILD_NUMBER);
}

// ============================================================
//  LOOP
// ============================================================
void loop() {
    esp_task_wdt_reset();

    // Reconstrucţia timerului — se face în loop(), nu din handler Blynk.
    // Elimină race condition-ul cu deleteTimer în timp ce timerul rulează.
    if (timerRebuildNeeded) {
        timerRebuildNeeded = false;
        rebuildMainTimer();
    }

    // Gestionare WiFi + Blynk
    bool wifiOk = (WiFi.status() == WL_CONNECTED);

    if (!wifiOk) {
        // Tracking WiFi down pentru restart preventiv (Faza 3)
        if (!wifiWasDown) {
            wifiWasDown = true;
            wifiDownSinceMs = millis();
        }
        // Restart preventiv dacă WiFi e down > WIFI_DOWN_RESTART_MS (10 min)
        if (millis() - wifiDownSinceMs >= WIFI_DOWN_RESTART_MS) {
            Serial.println("[WiFi] Down > 10 min. Restart preventiv...");
            mqtt.publishOnline(false);
            delay(200);
            safeStopRelays();
            delay(300);
            ESP.restart();
        }
        if (millis() - lastWiFiCheckMs > 30000) {
            lastWiFiCheckMs = millis();
            Serial.println("[WiFi] Conexiune pierdută. Reconectare...");
            WiFi.reconnect();
        }
    } else {
        // WiFi OK — reset tracking
        wifiWasDown = false;

        Blynk.run();
        // MQTT pump — non-blocking, gestionează reconnect cu backoff.
        mqtt.loop();
        // NTP re-sync la 24h (Faza 3)
        TimeSync::loop();
        // Procesare imediată comenzi MQTT (nu așteptăm timer-ul periodic)
        if (mqtt.hasPendingCommands()) {
            processZones();
        }
        // Heartbeat 1h + push pe schimbare automată stare releu + pushNow.
        mqtt.publishStateIfNeeded(leftZone, rightZone);
    }

    // Timer rulează întotdeauna — logica autonomă nu depinde de WiFi.
    timer.run();

    // Actualizăm LED-ul cu starea reală.
    statusLed.updateStatus(wifiOk, Blynk.connected());

    // Buton fizic reset WiFiManager — ţinut apăsat 3 secunde.
    if (digitalRead(RESET_BUTTON_PIN) == LOW) {
        if (!buttonHeld) {
            buttonHeld    = true;
            buttonPressMs = millis();
            statusLed.setColor(180, 180, 0);
        } else if (millis() - buttonPressMs > 3000) {
            Serial.println("[Buton] Reset WiFiManager declanşat.");
            statusLed.setWhite();
            safeStopRelays();
            delay(500);
            WiFiManager wm;
            wm.resetSettings();
            ESP.restart();
        }
    } else {
        buttonHeld = false;
    }
}
